/* 文件名: <header文件名>
 * 描述: <简短描述当前头文件功能>
 *
 * 边界:
 * 1. 该头文件仅供 <模块/库> 使用。
 * 2. 只包含外部需要的函数声明和宏定义。
 */

/* 头文件防护
 * **************************************************************/
#ifndef BSP_CH395__H
#define BSP_CH395__H

/* Private includes
 * **************************************************************/
/* 可以根据需要在此处包含必要的库或其他头文件 */
/* #include "some_other_header.h" */
#include <stdint.h>
/* Public macros
 * **************************************************************/
/* 宏定义，用于模块的配置和常量 */

/* Public function declarations
 * **************************************************************/
/* 对外提供的API接口声明 */

void bsp_ch395pins_init();
void bsp_ch395RSTI_set();
void bsp_ch395RSTI_reset();
uint8_t bsp_readINT();
void bsp_ch395_BaudrateSet(uint32_t baud);

/* 头文件结束
 * **************************************************************/
#endif /* <MODULE_NAME>_H */
